valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
// Button states
static uint8_t avto_active = 0;  // REMOVED but kept for compatibility
// stop_active - REMOVED (Stop button deleted)

// Auto mode control variables - REMOVED (AutoMode deleted)

/* Helper function to draw a button with text - no borders, white background */
void ILI9341_DrawControlButton(uint16_t x, uint16_t y, uint16_t width, uint16_t height, 
                               uint16_t color, const char* text, uint8_t text_size)
{
    // Draw button background (white by default, or specified color for special states)
    ILI9341_DrawRectangle(x, y, width, height, color);
    
    // No borders - clean white buttons
    
    // Draw text centered - black text on white background
    uint16_t text_x = x + (width - strlen(text) * 8 * text_size) / 2;
    uint16_t text_y = y + (height - 10 * text_size) / 2;
    ILI9341_DrawString(text_x, text_y, text, ILI9341_COLOR_BLACK, color, text_size);
}

/* Enhanced circular pressure gauge with better visualization */
void ILI9341_DrawPressureGauge(uint16_t center_x, uint16_t center_y, uint16_t radius, float pressure, float max_pressure)
{
    // Draw outer circle with thicker border
    for (int angle = 0; angle < 360; angle++) {
        int x = center_x + radius * cos(angle * 3.14159 / 180);
        int y = center_y + radius * sin(angle * 3.14159 / 180);
        if (x >= 0 && x < 320 && y >= 0 && y < 240) {
            ILI9341_DrawPixel(x, y, ILI9341_COLOR_WHITE);
            // Draw thicker border
            if (x > 0 && x < 319 && y > 0 && y < 239) {
                ILI9341_DrawPixel(x-1, y, ILI9341_COLOR_WHITE);
                ILI9341_DrawPixel(x+1, y, ILI9341_COLOR_WHITE);
                ILI9341_DrawPixel(x, y-1, ILI9341_COLOR_WHITE);
                ILI9341_DrawPixel(x, y+1, ILI9341_COLOR_WHITE);
            }
        }
    }
    
    // Draw scale marks (every 30 degrees)
    for (int mark = 0; mark < 6; mark++) {
        int angle = mark * 30;
        int x1 = center_x + (radius - 2) * cos((angle + 180) * 3.14159 / 180);
        int y1 = center_y + (radius - 2) * sin((angle + 180) * 3.14159 / 180);
        int x2 = center_x + (radius - 8) * cos((angle + 180) * 3.14159 / 180);
        int y2 = center_y + (radius - 8) * sin((angle + 180) * 3.14159 / 180);
        ILI9341_DrawLine(x1, y1, x2, y2, ILI9341_COLOR_WHITE);
    }
    
    // Draw pressure arc with color coding (0-180 degrees)
    float pressure_angle = (pressure / max_pressure) * 180.0;
    for (int angle = 0; angle < pressure_angle; angle++) {
        int x = center_x + (radius - 5) * cos((angle + 180) * 3.14159 / 180);
        int y = center_y + (radius - 5) * sin((angle + 180) * 3.14159 / 180);
        if (x >= 0 && x < 320 && y >= 0 && y < 240) {
            // Enhanced color coding with more zones
            uint16_t color;
            float percentage = (float)angle / 180.0;
            if (percentage < 0.3) {
                color = ILI9341_COLOR_GREEN;      // 0-30%: Green (Safe)
            } else if (percentage < 0.6) {
                color = ILI9341_COLOR_YELLOW;     // 30-60%: Yellow (Caution)
            } else if (percentage < 0.8) {
                color = ILI9341_COLOR_ORANGE;    // 60-80%: Orange (Warning)
            } else {
                color = ILI9341_COLOR_RED;       // 80-100%: Red (Danger)
            }
            ILI9341_DrawPixel(x, y, color);
        }
    }
    
    // Draw needle (pointer) showing current pressure
    if (pressure > 0) {
        float needle_angle = (pressure / max_pressure) * 180.0 + 180.0;
        int needle_x = center_x + (radius - 3) * cos(needle_angle * 3.14159 / 180);
        int needle_y = center_y + (radius - 3) * sin(needle_angle * 3.14159 / 180);
        ILI9341_DrawLine(center_x, center_y, needle_x, needle_y, ILI9341_COLOR_RED);
    }
    
    // Draw center dot
    ILI9341_DrawRectangle(center_x - 2, center_y - 2, 5, 5, ILI9341_COLOR_RED);
}

/* Main pressure control screen */
void ILI9341_ShowPressureControlMain(void)
{
    pressure_control_page = 0;
    
    // Clear screen
    ILI9341_FillScreen(ILI9341_COLOR_BLACK);
    
    // Title at top - "HIGH PRESSURE CONTROL"
    ILI9341_DrawString(40, 15, "HIGH PRESSURE CONTROL", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    
    // Pressure gauge in center - slightly below title
    ILI9341_DrawPressureGauge(160, 80, 35, current_pressure, 300.0);
    
    // Pressure value display below gauge with enhanced formatting
    char pressure_str[25];
    if (current_pressure < 10.0) {
        sprintf(pressure_str, "%.2f BAR", current_pressure);  // 2 decimal for low values
    } else if (current_pressure < 100.0) {
        sprintf(pressure_str, "%.1f BAR", current_pressure);  // 1 decimal for medium values
    } else {
        sprintf(pressure_str, "%.0f BAR", current_pressure);   // No decimal for high values
    }
    ILI9341_DrawString(130, 125, pressure_str, ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 2);
    
    // Show target pressure information (from Advanced system)
    SystemStatus_t* status = AdvancedPressureControl_GetStatus();
    char limit_str[30];
    sprintf(limit_str, "SP: %.0f bar", status->target_pressure);
    ILI9341_DrawString(10, 140, limit_str, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
    
    // Show safety status (based on target pressure)
    if (current_pressure > (status->target_pressure + 10.0f)) {
        ILI9341_DrawString(200, 140, "OVER LIMIT!", ILI9341_COLOR_RED, ILI9341_COLOR_BLACK, 1);
    } else if (current_pressure > status->target_pressure) {
        ILI9341_DrawString(200, 140, "NEAR LIMIT", ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
    } else {
        ILI9341_DrawString(200, 140, "SAFE", ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 1);
    }
    
    // Control buttons (Menu) - below pressure display
    ILI9341_DrawControlButton(15, 150, 70, 35, ILI9341_COLOR_WHITE, "Menu", 1);
    // Auto button - REMOVED (AutoMode deleted)
    // Manual button - REMOVED (Manual mode deleted)
    // Stop button - REMOVED (Stop button deleted)
    
    /* Auto mode status display - REMOVED (AutoMode deleted) */
    
