valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
        for (int p = 0; p < 4; p++) {
            uint16_t sx, sy;
            XPT2046_ConvertToScreen(cal_raw_x[p], cal_raw_y[p], &sx, &sy);
            
            int32_t ex = (int32_t)sx - (int32_t)cal_screen_x[p];
            int32_t ey = (int32_t)sy - (int32_t)cal_screen_y[p];
            
            char result[48];
            sprintf(result, "P%d: (%d,%d)->(%d,%d) err:%ld", 
                    p + 1, cal_screen_x[p], cal_screen_y[p], sx, sy,
                    (ex*ex + ey*ey));
            
            uint16_t color = ((ex*ex + ey*ey) < 400) ? ILI9341_COLOR_GREEN : ILI9341_COLOR_ORANGE;
            ILI9341_DrawString(10, 115 + p * 18, result, color, ILI9341_COLOR_BLACK, 1);
        }
        
        /* Kalibrasiya dəyərlərini göstər */
        char cal_info[48];
        sprintf(cal_info, "X:[%d-%d] Y:[%d-%d]", new_x_min, new_x_max, new_y_min, new_y_max);
        ILI9341_DrawString(10, 195, cal_info, ILI9341_COLOR_MAGENTA, ILI9341_COLOR_BLACK, 1);
        
        ILI9341_DrawString(60, 220, "Touch to continue...", ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
        
        /* Touch gözlə */
        HAL_Delay(1500);
        while (!XPT2046_IsTouched()) {
            HAL_Delay(50);
        }
        while (XPT2046_IsTouched()) {
            HAL_Delay(50);
        }
        
    } else {
        /* Kalibrasiya uğursuz - default istifadə et */
        printf("4-Point Calibration FAILED - using defaults\r\n");
        
        XPT2046_LoadDefaultCalibration();
        XPT2046_SetCoordMode(3);  /* SwapOnly - ən çox işləyən */
        
        ILI9341_DrawString(30, 80, "CALIBRATION FAILED!", ILI9341_COLOR_RED, ILI9341_COLOR_BLACK, 2);
        ILI9341_DrawString(50, 120, "Using default Mode 3", ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
        ILI9341_DrawString(40, 150, "Try again after reboot", ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
        
        HAL_Delay(3000);
    }
    
    printf("=== 4-POINT TOUCH CALIBRATION COMPLETE ===\r\n\n");
    return cal_success;
}
